[
	{
		"id": 0,
		"skill": "Lua",
		"description": "Lua is a powerful, efficient, lightweight, embeddable scripting language. It supports procedural programming, object-oriented programming, functional programming, data-driven programming, and data description."
	},
	{
		"id": 1,
		"skill": "TypeScript",
		"description": "Working with functions, types, interfaces, writing optimized and usable code (examples on gitHub)."
	},
	{
		"id": 2,
		"skill": "JavaScript",
		"description": "Working with API, ability to port code to TypeScript for ease of use in the development environment, writing clean code, optimization, ability to use imports."
	},
	{
		"id": 3,
		"skill": "HTML",
		"description": "Understanding of standard tags, attributes, classes, SEO."
	},
	{
		"id": 4,
		"skill": "CSS",
		"description": "Writing standard styles for blocks, text, etc."
	},
	{
		"id": 5,
		"skill": "SASS / SCSS",
		"description": "Advanced CSS style writing for large projects, most often using SCSS to collaborate with Code Prettier in Visual Studio Code for small projects."
	},
	{
		"id": 6,
		"skill": "Tailwind",
		"description": "Using a user interface design tool that provides a set of ready-made CSS classes that facilitate the styling of web pages and components is great to use in conjunction with SCSS."
	},
	{
		"id": 7,
		"skill": "NodeJS",
		"description": "Working with the server side and the use of Node JS environment in general. Knowledge of server-side coding and understanding of standard back-end tasks. Use of standard Express library, ability to use npm, yarn package managers."
	},
	{
		"id": 8,
		"skill": "Express",
		"description": "Working with the server side and the use of Node JS environment in general. Knowledge of server-side coding and understanding of standard back-end tasks. Use of standard Express library, ability to use npm, yarn package managers."
	},
	{
		"id": 9,
		"skill": "NextJS",
		"description": "Vercel's frontend cloud gives developers the frameworks, workflows, and infrastructure to build a faster, more personalized Web."
	},
	{
		"id": 10,
		"skill": "Git / GitHub",
		"description": "Ability to use a version control service...Working with repositories, branches, collaborations and project management."
	},
	{
		"id": 11,
		"skill": "Adaptability",
		"description": "I consider my main ability to quickly adapt to any task, the ability to quickly perceive new documentation of different libraries/frameworks."
	}
]
